wosayttn/M55M1BSP/_CUnit/lpi2c/lpi2c_cunit.c

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of system headers                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>
#include "NuMicro.h"
#include "CUnit.h"
#include "Console.h"
#include "lpi2c_cunit.h"


/*---------------------------------------------------------------------------------------------------------*/
/* Includes of local headers                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
#include "CUnit.h"
#include "Console.h"

#if 0
#define DBG_MSG printf
#else
#define DBG_MSG(...)
#endif


/*Variables for read, write APIs test*/
typedef void (*LPI2C_FUNC)(uint32_t u32Status);
uint8_t *pu8dstBuf = NULL;
const uint8_t *pu8srcBuf = NULL;
volatile uint16_t g_u16AddressTmp = 0; // for EEPROM address checking
volatile uint32_t g_u32Idx;
volatile uint32_t u32RceLen;
volatile uint8_t  g_u8RegAddrBytes = 0;
LPI2C_FUNC fpI2C_WrRd_Test_Handler = NULL;


/*---------------------------------------------------------------------------------------------------------*/
/* Global variables                                                                                        */
/*---------------------------------------------------------------------------------------------------------*/

volatile uint8_t g_u8SlvData[256];
volatile uint8_t g_au8RxData[4];
volatile uint8_t g_u8DeviceAddr;
volatile uint8_t g_u8ARA_Addr;
volatile uint8_t g_au8TxData[4];
volatile uint8_t g_u8RxData;
volatile uint8_t g_u8DataLen0;
volatile uint8_t g_u8DataLen1;
volatile uint8_t g_u8EndFlag = 0;
volatile uint8_t g_u8SendPEC = 0;
volatile uint8_t g_u8AlertInt0 = 0;
volatile uint8_t g_u8AlertInt1 = 0;
volatile uint8_t g_u8AlertAddrAck0 = 0;
volatile uint8_t g_u8AlertAddrAck1 = 0;

typedef void (*I2C_FUNC)(uint32_t u32Status);

static volatile I2C_FUNC s_I2C0HandlerFn = NULL;
static volatile I2C_FUNC s_LPI2C0HandlerFn = NULL;


/*Variables for read, write APIs test*/
extern I2C_FUNC fpI2C_WrRd_Test_Handler;

/*---------------------------------------------------------------------------------------------------------*/
/*  I2C0 IRQ Handler                                                                                       */
/*---------------------------------------------------------------------------------------------------------*/
void I2C0_IRQHandler(void)
{
    uint32_t u32Status;
    uint8_t u8data;
    u32Status = I2C_GET_STATUS(I2C0);

    if (fpI2C_WrRd_Test_Handler) { //if not point to null=> test Wr, Rd APIs.
        /*For test APIs:
            LPI2C_WriteByte,
            LPI2C_WriteMultiBytes
            LPI2C_WriteByteOneReg
            LPI2C_WriteMultiBytesOneReg
            LPI2C_WriteByteTwoRegs
            LPI2C_WriteMultiBytesTwoRegs
            LPI2C_ReadByte
            LPI2C_ReadMultiBytes
            LPI2C_ReadByteOneReg
            LPI2C_ReadMultiBytesOneReg
            LPI2C_ReadByteTwoRegs
            LPI2C_ReadMultiBytesTwoRegs
        */
        fpI2C_WrRd_Test_Handler(u32Status);
        return;
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/*  Power Wake-up IRQ Handler                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
void PMC_IRQHandler(void)
{
    printf("@PMC_IRQ!!!");

    /* check power down wakeup flag */
    if ((PMC->INTSTS & PMC_INTSTS_PDWKIF_Msk) == PMC_INTSTS_PDWKIF_Msk) {
        printf("PMC_IRQ!!! PMC_INTSTS = 0x%08x\n", PMC->INTSTS);
    }

    PMC->INTSTS |= PMC_INTSTS_CLRWK_Msk;

    while (PMC->INTSTS & PMC_INTSTS_PDWKIF_Msk);
}

/*---------------------------------------------------------------------------------------------------------*/
/*  I2C0 IRQ Handler                                                                                       */
/*---------------------------------------------------------------------------------------------------------*/
void LPI2C0_IRQHandler(void)
{
    uint32_t u32Status;
    u32Status = I2C_GET_STATUS(I2C0);
    printf("I2C0_STA: %08X\n", u32Status);

    if (I2C_GET_TIMEOUT_FLAG(I2C0)) {
        /* Clear I2C0 Timeout Flag */
        I2C_ClearTimeoutFlag(I2C0);
    } else {
        if (s_LPI2C0HandlerFn != NULL) {
            s_LPI2C0HandlerFn(u32Status);
        }
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/* Test function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/

int suite_success_init(void)
{
    return 0;
}
int suite_success_clean(void)
{
    return 0;
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function: function_name                                                                                 */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               param - [in/out], parameter_description                                                   */
/*               param - [in/out], parameter_description                                                   */
/*                                                                                                         */
/* Returns:      the_value                                                                                 */
/* Side effects: the_effect                                                                                */
/* Description:                                                                                            */
/*               description                                                                               */
/*---------------------------------------------------------------------------------------------------------*/

CU_SuiteInfo suites[] = {
#if defined(POWER_DOWN_TEST)
    {"LPI2C Wakeup API Macro", suite_success_init, suite_success_clean, NULL, NULL, LPI2C_WakeupAPIMacroTests},
#else
    {"LPI2C CONST", suite_success_init, suite_success_clean, NULL, NULL, LPI2C_ConstTests},
    {"LPI2C API", suite_success_init, suite_success_clean, NULL, NULL, LPI2C_ApiTests},
    {"LPI2C MACRO", suite_success_init, suite_success_clean, NULL, NULL, LPI2C_MacroTests},
#endif
    CU_SUITE_INFO_NULL
};

