wosayttn/M55M1BSP/_CUnit/lpi2c/lpi2c_cunit.c
void LPI2C_Reset(void)
{
    SYS_UnlockReg();
    SYS_ResetModule(SYS_LPI2C0RST);
    SYS_ResetModule(SYS_I2C0RST);
}

/*
    LPI2C_Open
    LPI2C_Close
*/
void Test_API_LPI2C_Open_Close()
{
    uint32_t u32BusClock;
    LPI2C_T *i2c = LPI2C0;
    CU_ASSERT((CLK->LPI2CCTL & CLK_LPI2CCTL_LPI2C0CKEN_Msk) == CLK_LPI2CCTL_LPI2C0CKEN_Msk);
    LPI2C_Reset();

    if ((i2c->CTL0 & LPI2C_CTL0_LPI2CEN_Msk) != 0x00) {
        while (1);
    }

    /* API LPI2C_Open Test*/
    u32BusClock = 100000; //standard mode
    CU_ASSERT_EQUAL(LPI2C_Open(i2c, u32BusClock), u32BusClock);
    CU_ASSERT((i2c->CTL0 & LPI2C_CTL0_LPI2CEN_Msk) == LPI2C_CTL0_LPI2CEN_Msk);
    u32BusClock = 200000;
    CU_ASSERT_EQUAL(LPI2C_Open(i2c, u32BusClock), u32BusClock);
    CU_ASSERT((i2c->CTL0 & LPI2C_CTL0_LPI2CEN_Msk) == LPI2C_CTL0_LPI2CEN_Msk);
//    u32BusClock = 400000;  //Fast mode, PCLK=12MHz cannot be Divisible for 400KHz case
//    CU_ASSERT_EQUAL(LPI2C_Open(i2c, u32BusClock), u32BusClock);
//    CU_ASSERT((i2c->CTL0 & LPI2C_CTL0_LPI2CEN_Msk) == LPI2C_CTL0_LPI2CEN_Msk);
    u32BusClock = 1000000; //Fast plus mode
    CU_ASSERT_EQUAL(LPI2C_Open(i2c, u32BusClock), u32BusClock);
    CU_ASSERT((i2c->CTL0 & LPI2C_CTL0_LPI2CEN_Msk) == LPI2C_CTL0_LPI2CEN_Msk);
    /* API LPI2C_Close Test*/
    LPI2C_Close(i2c);
    CU_ASSERT((i2c->CTL0 & LPI2C_CTL0_LPI2CEN_Msk) != LPI2C_CTL0_LPI2CEN_Msk);
}

/*
    LPI2C_Open
	LPI2C_GetBusClockFreq
	LPI2C_SetBusClockFreq
	LPI2C_Close
*/
void Test_API_LPI2C_BusClockFreq()
{
    uint32_t u32BusClock;
    LPI2C_T *i2c = LPI2C0;
    u32BusClock = 100000;
    LPI2C_Open(i2c, u32BusClock);
    CU_ASSERT_EQUAL(LPI2C_GetBusClockFreq(i2c), LPI2C_Open(i2c, u32BusClock));
    CU_ASSERT_EQUAL(LPI2C_SetBusClockFreq(i2c, u32BusClock), LPI2C_Open(i2c, u32BusClock));
    LPI2C_Close(i2c);
}

/*
    LPI2C_EnableInt
	LPI2C_DisableInt
*/
void Test_API_LPI2C_INT()
{
    LPI2C_T *i2c = LPI2C0;
    LPI2C_EnableInt(i2c);
    CU_ASSERT_EQUAL((i2c->CTL0 & LPI2C_CTL0_INTEN_Msk), LPI2C_CTL0_INTEN_Msk);
    //
    LPI2C_DisableInt(i2c);
    CU_ASSERT_NOT_EQUAL((i2c->CTL0 & LPI2C_CTL0_INTEN_Msk), LPI2C_CTL0_INTEN_Msk);
}

/*
    LPI2C_SetSlaveAddr
    LPI2C_SetSlaveAddrMask
*/
void Test_API_LPI2C_SetSLVAddr()
{
    uint32_t j;
    uint8_t LPI2C_SLVAddr[4] = {15, 35, 55, 75};
    uint8_t LPI2C_SLVAddrMsk[4] = {0x01, 0x04, 0x01, 0x04};
    LPI2C_T *i2c = LPI2C0;

    for (j = 0; j < 4; j++) {
        LPI2C_SetSlaveAddr(i2c, j, LPI2C_SLVAddr[j], LPI2C_GCMODE_DISABLE);
        LPI2C_SetSlaveAddrMask(LPI2C0, j, LPI2C_SLVAddrMsk[j]);

        switch (j) {
            case 0:
                CU_ASSERT_EQUAL(i2c->ADDR0 & LPI2C_ADDR0_GC_Msk, LPI2C_GCMODE_DISABLE);
                CU_ASSERT_EQUAL((i2c->ADDR0) >> LPI2C_ADDR0_ADDR_Pos, LPI2C_SLVAddr[j]);
                CU_ASSERT_EQUAL((i2c->ADDRMSK0) >> LPI2C_ADDRMSK0_ADDRMSK_Pos, LPI2C_SLVAddrMsk[j]);
                break;

            case 1:
                CU_ASSERT_EQUAL(i2c->ADDR1 & LPI2C_ADDR1_GC_Msk, LPI2C_GCMODE_DISABLE);
                CU_ASSERT_EQUAL((i2c->ADDR1) >> LPI2C_ADDR1_ADDR_Pos, LPI2C_SLVAddr[j]);
                CU_ASSERT_EQUAL((i2c->ADDRMSK1) >> LPI2C_ADDRMSK1_ADDRMSK_Pos, LPI2C_SLVAddrMsk[j]);
                break;

            case 2:
                CU_ASSERT_EQUAL(i2c->ADDR2 & LPI2C_ADDR2_GC_Msk, LPI2C_GCMODE_DISABLE);
                CU_ASSERT_EQUAL((i2c->ADDR2) >> LPI2C_ADDR2_ADDR_Pos, LPI2C_SLVAddr[j]);
                CU_ASSERT_EQUAL((i2c->ADDRMSK2) >> LPI2C_ADDRMSK2_ADDRMSK_Pos, LPI2C_SLVAddrMsk[j]);
                break;

            case 3:
                CU_ASSERT_EQUAL(i2c->ADDR3 & LPI2C_ADDR3_GC_Msk, LPI2C_GCMODE_DISABLE);
                CU_ASSERT_EQUAL((i2c->ADDR3) >> LPI2C_ADDR3_ADDR_Pos, LPI2C_SLVAddr[j]);
                CU_ASSERT_EQUAL((i2c->ADDRMSK3) >> LPI2C_ADDRMSK3_ADDRMSK_Pos, LPI2C_SLVAddrMsk[j]);
                break;
        }
    }

    //
    for (j = 0; j < 4; j++) {
        LPI2C_SetSlaveAddr(i2c, j, LPI2C_SLVAddr[j], LPI2C_GCMODE_ENABLE);

        switch (j) {
            case 0:
                CU_ASSERT_EQUAL(i2c->ADDR0 & LPI2C_ADDR0_GC_Msk, LPI2C_GCMODE_ENABLE);
                break;

            case 1:
                CU_ASSERT_EQUAL(i2c->ADDR1 & LPI2C_ADDR1_GC_Msk, LPI2C_GCMODE_ENABLE);
                break;

            case 2:
                CU_ASSERT_EQUAL(i2c->ADDR2 & LPI2C_ADDR2_GC_Msk, LPI2C_GCMODE_ENABLE);
                break;

            case 3:
                CU_ASSERT_EQUAL(i2c->ADDR3 & LPI2C_ADDR3_GC_Msk, LPI2C_GCMODE_ENABLE);
        }
    }
}

void Test_API_LPI2C_Set_Get_Data()
{
    /*
        The LPI2Cn_DAT register will clear data after new data be writen in
        So we disable the following asseration.
    */
    //    LPI2C_SetData(LPI2C0, 0x5A);
    //    CU_ASSERT_EQUAL(LPI2C0->DAT, 0x5A);
    //    CU_ASSERT_EQUAL(LPI2C_GetData(LPI2C0), 0x5A);
    //    LPI2C_SetData(I2C0, 0xA5);
    //    CU_ASSERT_EQUAL(I2C0->DAT, 0xA5);
    //    CU_ASSERT_EQUAL(LPI2C_GetData(I2C0), 0xA5);
}

/*
    LPI2C_Open
    LPI2C_EnableTimeout
    LPI2C_ClearTimeoutFlag
    LPI2C_DisableTimeout
    LPI2C_DisableInt
*/
void Test_API_LPI2C_Timeout()
{
    uint32_t  i;
    LPI2C_T *i2c = LPI2C0;
    LPI2C_Open(i2c, 100000);
    LPI2C_EnableTimeout(i2c, 1);
    CU_ASSERT_EQUAL(i2c->TOCTL & LPI2C_TOCTL_TOCDIV4_Msk, LPI2C_TOCTL_TOCDIV4_Msk);
    CU_ASSERT_EQUAL(i2c->TOCTL & LPI2C_TOCTL_TOCEN_Msk, LPI2C_TOCTL_TOCEN_Msk);

    while ((i2c->TOCTL & LPI2C_TOCTL_TOIF_Msk) == 0);

    LPI2C_ClearTimeoutFlag(i2c);
    CU_ASSERT_EQUAL(i2c->TOCTL & LPI2C_TOCTL_TOIF_Msk, 0);
    LPI2C_DisableTimeout(i2c);
    CU_ASSERT_EQUAL(i2c->TOCTL & LPI2C_TOCTL_TOIF_Msk, 0);
    SYS_UnlockReg();
    LPI2C_Close(i2c);
}

void Test_API_LPI2C_Control_Read_Status()
{
    uint32_t  i;
    LPI2C_T *i2c_master = LPI2C0;
    I2C_T *i2c_slave = I2C0;
    //
    LPI2C_Reset();
    //
    /* Open LPI2C0 module and set bus clock */
    LPI2C_Open(i2c_master, 100000);
    /* Enable LPI2C */
    i2c_master->CTL0 |= LPI2C_CTL0_LPI2CEN_Msk;
    /* Open I2C0 module and set bus clock */
    I2C_Open(i2c_slave, 100000);
    /* Enable LPI2C */
    i2c_slave->CTL0 |= I2C_CTL0_I2CEN_Msk;
    /* Set i2c_slave 4 Slave Addresses */
    I2C_SetSlaveAddr(i2c_slave, 0, 0x16, 0);   /* Slave Address : 0x16 */
    I2C_SetSlaveAddr(i2c_slave, 1, 0x36, 0);   /* Slave Address : 0x36 */
    I2C_SetSlaveAddr(i2c_slave, 2, 0x56, 0);   /* Slave Address : 0x56 */
    I2C_SetSlaveAddr(i2c_slave, 3, 0x76, 0);   /* Slave Address : 0x76 */
    /* Set i2c_slave 4 Slave Addresses Mask */
    I2C_SetSlaveAddrMask(i2c_slave, 0, 0x04);
    I2C_SetSlaveAddrMask(i2c_slave, 1, 0x02);
    I2C_SetSlaveAddrMask(i2c_slave, 2, 0x04);
    I2C_SetSlaveAddrMask(i2c_slave, 3, 0x02);
    /* LPI2C enter no address SLV mode */
    I2C_SET_CONTROL_REG(i2c_slave, I2C_CTL_SI_AA);
    /* LPI2C as master sends START signal */
    i2c_master->CTL0 |= LPI2C_CTL0_STA_Msk;
    // CU_ASSERT((i2c_master->CTL0 & LPI2C_CTL_STA) == LPI2C_CTL_STA);

