wosayttn/M55M1BSP/_CUnit/lpi2c/lpi2c_cunit.c
void Test_Macro_LPI2C_Timeout()
{
    LPI2C_Open(LPI2C0, 100000);
    LPI2C_EnableTimeout(LPI2C0, 1);
    CU_ASSERT_EQUAL(LPI2C0->TOCTL & LPI2C_TOCTL_TOCDIV4_Msk, LPI2C_TOCTL_TOCDIV4_Msk);
    CU_ASSERT_EQUAL(LPI2C0->TOCTL & LPI2C_TOCTL_TOCEN_Msk, LPI2C_TOCTL_TOCEN_Msk);
    CU_ASSERT_EQUAL(LPI2C0->TOCTL & LPI2C_TOCTL_TOIF_Msk, 0);

    while (LPI2C_GET_TIMEOUT_FLAG(LPI2C0) == 0) {};

    CU_ASSERT_EQUAL(LPI2C0->TOCTL & LPI2C_TOCTL_TOIF_Msk, LPI2C_TOCTL_TOIF_Msk);

    LPI2C_ClearTimeoutFlag(LPI2C0);

    CU_ASSERT_EQUAL(LPI2C0->TOCTL & LPI2C_TOCTL_TOIF_Msk, 0);

    LPI2C_DisableTimeout(LPI2C0);

    CU_ASSERT_EQUAL(LPI2C0->TOCTL & LPI2C_TOCTL_TOCEN_Msk, 0);

    LPI2C_Close(LPI2C0);
}

void Test_MACRO_LPI2C_Control_Read_Status()
{
    /* Open LPI2C0 module and set bus clock */
    LPI2C_Open(LPI2C0, 100000);
    /* Open I2C0 module and set bus clock */
    I2C_Open(I2C0, 100000);
    /* Set I2C0 4 Slave Addresses */
    I2C_SetSlaveAddr(I2C0, 0, 0x16, 0);   /* Slave Address : 0x16 */
    I2C_SetSlaveAddr(I2C0, 1, 0x36, 0);   /* Slave Address : 0x36 */
    I2C_SetSlaveAddr(I2C0, 2, 0x56, 0);   /* Slave Address : 0x56 */
    I2C_SetSlaveAddr(I2C0, 3, 0x76, 0);   /* Slave Address : 0x76 */
    /* Set I2C0 4 Slave Addresses Mask */
    I2C_SetSlaveAddrMask(I2C0, 0, 0x04);
    I2C_SetSlaveAddrMask(I2C0, 1, 0x02);
    I2C_SetSlaveAddrMask(I2C0, 2, 0x04);
    I2C_SetSlaveAddrMask(I2C0, 3, 0x02);
    /* I2C0 enter no address SLV mode */
    I2C_SET_CONTROL_REG(I2C0, LPI2C_CTL_SI_AA);
    //
    LPI2C_START(LPI2C0);
    CU_ASSERT((LPI2C0->CTL0 & LPI2C_CTL_STA) == LPI2C_CTL_STA);
    LPI2C_WAIT_READY(LPI2C0) {};
    CU_ASSERT((LPI2C0->CTL0 & LPI2C_CTL0_SI_Msk) == LPI2C_CTL0_SI_Msk);

    while (LPI2C_GET_STATUS(LPI2C0) != 0x08);

    LPI2C_SET_DATA(LPI2C0, 0x16 << 1);
    CU_ASSERT(LPI2C_GET_DATA(LPI2C0) == (0x16 << 1));
    LPI2C_SET_CONTROL_REG(LPI2C0, LPI2C_CTL_SI);
    CU_ASSERT((LPI2C0->CTL0 & LPI2C_CTL_SI) == 0);
    LPI2C_WAIT_READY(LPI2C0);

    while (LPI2C_GET_STATUS(LPI2C0) != 0x18);

    LPI2C_SET_CONTROL_REG(LPI2C0, LPI2C_CTL_SI);
    //

    while (I2C_GET_STATUS(I2C0) != 0x60);

    I2C_SET_CONTROL_REG(I2C0, LPI2C_CTL_SI);
    //
    LPI2C_STOP(LPI2C0);
    CU_ASSERT((LPI2C0->CTL0 & LPI2C_CTL_STO_SI) != LPI2C_CTL_STO);
    //

    while (I2C_GET_STATUS(I2C0) != 0xA0);

    I2C_SET_CONTROL_REG(I2C0, I2C_CTL_SI_AA);
    //
    LPI2C_Close(LPI2C0);
    I2C_Close(I2C0);
}

void Test_API_MACRO_LPI2C_Wakeup()
{
    /* Open LPI2C module and set bus clock */
    LPI2C_Open(LPI2C0, 100000);
    /* Set LPI2C 4 Slave Addresses */
    LPI2C_SetSlaveAddr(LPI2C0, 0, 0x15, 0);   /* Slave Address : 0x15 */
    LPI2C_SetSlaveAddr(LPI2C0, 1, 0x35, 0);   /* Slave Address : 0x35 */
    LPI2C_SetSlaveAddr(LPI2C0, 2, 0x55, 0);   /* Slave Address : 0x55 */
    LPI2C_SetSlaveAddr(LPI2C0, 3, 0x75, 0);   /* Slave Address : 0x75 */
    /* Set LPI2C 4 Slave Addresses Mask */
    LPI2C_SetSlaveAddrMask(LPI2C0, 0, 0x01);
    LPI2C_SetSlaveAddrMask(LPI2C0, 1, 0x04);
    LPI2C_SetSlaveAddrMask(LPI2C0, 2, 0x01);
    LPI2C_SetSlaveAddrMask(LPI2C0, 3, 0x04);
    /* Set LPI2C0 enter Not Address SLAVE mode */
    LPI2C_SET_CONTROL_REG(LPI2C0, LPI2C_CTL_SI_AA);
    /* Unlock protected registers */
    SYS_UnlockReg();
    /* Enable power wake-up interrupt */
    PMC->INTEN |= PMC_INTEN_PDWKIEN_Msk;
    NVIC_EnableIRQ(PMC_IRQn);
    /* Enable LPI2C wake-up */
    LPI2C_EnableWakeup(LPI2C0);
    CU_ASSERT((LPI2C0->WKCTL & LPI2C_WKCTL_WKEN_Msk) == LPI2C_WKCTL_WKEN_Msk);
    printf("\n");
    printf("Enter PD 0x%x 0x%x\n", LPI2C0->CTL0, LPI2C0->STATUS0);
    printf("\n");
    printf("CHIP enter power down status.\n");

    /* Waiting for UART printf finish*/
    while (((UART0->FIFOSTS) & UART_FIFOSTS_TXEMPTY_Msk) == 0);

    if (((LPI2C0->CTL0)&LPI2C_CTL0_SI_Msk) != 0) {
        LPI2C_SET_CONTROL_REG(LPI2C0, LPI2C_CTL_SI);
    }

    PMC_SetPowerDownMode(PMC_NPD0, PMC_PLCTL_PLSEL_PL1);
    PMC_PowerDown();
    printf("Wake up!!\n");
    NVIC_DisableIRQ(PMC_IRQn);
    printf(">>>1\n");

    if ((LPI2C0->WKSTS & LPI2C_WKSTS_WKIF_Msk) == LPI2C_WKSTS_WKIF_Msk) {
        printf(">>>2\n");
        CU_ASSERT(LPI2C_GET_WAKEUP_FLAG(LPI2C0) == 1);
        LPI2C_CLEAR_WAKEUP_FLAG(LPI2C0);
        CU_ASSERT(LPI2C_GET_WAKEUP_FLAG(LPI2C0) == 0);
    }

    /* Lock protected registers */
    SYS_LockReg();
    LPI2C_DisableWakeup(LPI2C0);
    CU_ASSERT((LPI2C0->WKCTL & LPI2C_WKCTL_WKEN_Msk) == 0);
    LPI2C_Close(LPI2C0);
    printf(">>>3\n");
}

void Test_API_MACRO_LPI2C_PDMA()
{
    /* Enable/disable TX PDMA */
    CU_ASSERT((LPI2C0->CTL1 & LPI2C_CTL1_TXPDMAEN_Msk) == 0);
    LPI2C_ENABLE_TX_PDMA(LPI2C0);
    CU_ASSERT((LPI2C0->CTL1 & LPI2C_CTL1_TXPDMAEN_Msk) == LPI2C_CTL1_TXPDMAEN_Msk);
    LPI2C_DISABLE_TX_PDMA(LPI2C0);
    CU_ASSERT((LPI2C0->CTL1 & LPI2C_CTL1_TXPDMAEN_Msk) == 0);
    /* Enable/disable RX PDMA */
    CU_ASSERT((LPI2C0->CTL1 & LPI2C_CTL1_RXPDMAEN_Msk) == 0);
    LPI2C_ENABLE_RX_PDMA(LPI2C0);
    CU_ASSERT((LPI2C0->CTL1 & LPI2C_CTL1_RXPDMAEN_Msk) == LPI2C_CTL1_RXPDMAEN_Msk);
    LPI2C_DISABLE_RX_PDMA(LPI2C0);
    CU_ASSERT((LPI2C0->CTL1 & LPI2C_CTL1_RXPDMAEN_Msk) == 0);
    /* Enable/disable PDMA stretch function */
    CU_ASSERT((LPI2C0->CTL1 & LPI2C_CTL1_PDMASTR_Msk) == 0);
    LPI2C_ENABLE_PDMA_STRETCH(LPI2C0);
    CU_ASSERT((LPI2C0->CTL1 & LPI2C_CTL1_PDMASTR_Msk) == LPI2C_CTL1_PDMASTR_Msk);
    LPI2C_DISABLE_PDMA_STRETCH(LPI2C0);
    CU_ASSERT((LPI2C0->CTL1 & LPI2C_CTL1_PDMASTR_Msk) == 0);
}

void Test_CONST_LPI2C_CTL(void)
{
    CU_ASSERT(LPI2C_CTL_STA_SI == (LPI2C_CTL0_STA_Msk | LPI2C_CTL0_SI_Msk));
    CU_ASSERT(LPI2C_CTL_STA_SI_AA == (LPI2C_CTL0_STA_Msk | LPI2C_CTL0_SI_Msk | LPI2C_CTL0_AA_Msk));
    CU_ASSERT(LPI2C_CTL_STO_SI == (LPI2C_CTL0_STO_Msk | LPI2C_CTL0_SI_Msk));
    CU_ASSERT(LPI2C_CTL_STO_SI_AA == (LPI2C_CTL0_STO_Msk | LPI2C_CTL0_SI_Msk | LPI2C_CTL0_AA_Msk));
    CU_ASSERT(LPI2C_CTL_SI == LPI2C_CTL0_SI_Msk);
    CU_ASSERT(LPI2C_CTL_SI_AA == (LPI2C_CTL0_SI_Msk | LPI2C_CTL0_AA_Msk));
    CU_ASSERT(LPI2C_CTL_STA == LPI2C_CTL0_STA_Msk);
    CU_ASSERT(LPI2C_CTL_STO == LPI2C_CTL0_STO_Msk);
    CU_ASSERT(LPI2C_CTL_AA == LPI2C_CTL0_AA_Msk);
}

void Test_CONST_LPI2C_GCMode(void)
{
    CU_ASSERT(LPI2C_GCMODE_ENABLE == 1);
    CU_ASSERT(LPI2C_GCMODE_DISABLE == 0);
}

CU_TestInfo LPI2C_ConstTests[] = {
    {" 1: CONST LPI2C_CTL.", Test_CONST_LPI2C_CTL},
    {" 2: CONST LPI2C_GCMode.", Test_CONST_LPI2C_GCMode},
    CU_TEST_INFO_NULL
};

CU_TestInfo LPI2C_ApiTests[] = {
    {" 1: API LPI2C_Open_Close.", Test_API_LPI2C_Open_Close},
    {" 2: API LPI2C_Get_Bus_Clock", Test_API_LPI2C_BusClockFreq},
    {" 3: API LPI2C_INT_En_Dis_ABLE", Test_API_LPI2C_INT},
    {" 4: API LPI2C_Set_SLV_Address", Test_API_LPI2C_SetSLVAddr},
    {" 5: API LPI2C_Set_Get_Data", Test_API_LPI2C_Set_Get_Data},
    {" 6: API LPI2C_Time-out_En_Dis_able", Test_API_LPI2C_Timeout},
    {" 7: API LPI2C_Control_Read_STATUS", Test_API_LPI2C_Control_Read_Status},
    {" 8: API LPI2C_ReadWriteRelatedTest", Test_API_LPI2C_ReadWriteRelatedTest},
    CU_TEST_INFO_NULL
};

CU_TestInfo LPI2C_MacroTests[] = {
    {" 1: MACRO LPI2C_Get_TimeOutFlag", Test_Macro_LPI2C_Timeout},
    {" 2: MACRO LPI2C_Control_Read_STATUS", Test_MACRO_LPI2C_Control_Read_Status},
    {" 3: MACRO LPI2C_PDMA", Test_API_MACRO_LPI2C_PDMA},
    CU_TEST_INFO_NULL
};

CU_TestInfo LPI2C_WakeupAPIMacroTests[] = {
    {" 1: API_MACRO LPI2C_Wakeup", Test_API_MACRO_LPI2C_Wakeup}, //NuBridge may pull the bus, so it should test independently
    CU_TEST_INFO_NULL
};
